package com.caidian310.presenter

object AgreementStringPresenter {


    /**
     * 用户协议
     */
    var userAgreementString: String? = """
 平台服务协议
【导言】
本协议是您与本平台之间关于您使用本平台服务所订立的协议。为使用本平台服务，您应当阅读并遵守《平台服务协议》(以下简称“本协议”)。请您务必审慎阅读、充分理解各条款内容，并选择接受或不接受。特别是以下以黑体加粗形式提示您注意的限制、免责条款内容。在本平台登记注册的用户，并同意以下条款，方有资格享受本平台提供的相关服务，并受本协议条款的约束。用户使用本平台服务即意味着同意本协议，使用前请认真阅读。请保证您在使用本服务时已满18周岁，且具有完全民事行为能力。
一、注册规则
1. 本平台的注册资料包括但不限于用户在平台上的昵称、头像，以及用户在本平台提交的、可用来识别用户身份的其他信息资料，包括更新注册资料时输入的所有信息。
2. 用户在本平台登记注册时，承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不在其注册资料中出现违法和不良信息，且用户保证其在注册和使用账号时，不得有以下情形：
（1）违反宪法或法律法规规定的；
（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
（3）损害国家荣誉和利益的，损害公共利益的；
（4）煽动民族仇恨、民族歧视，破坏民族团结的；
（5）破坏国家宗教政策，宣扬邪教和封建迷信的；
（6）散布谣言，扰乱社会秩序，破坏社会稳定的；
（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
（8）侮辱或者诽谤他人，侵害他人合法权益的；
（9）含有法律、行政法规禁止的其他内容的。
3. 若用户提供给本平台的注册资料不准确，不真实，含有违法或不良信息的，本平台有权不予注册，并保留终止用户使用本平台各项服务的权利。若用户以虚假信息骗取账号注册或账号头像、个人简介等注册资料存在违法和不良信息的，本平台有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册账号名称的，本平台有权注销该账号，并向政府主管部门进行报告。
4. 根据相关法律、法规规定以及考虑本平台服务的重要性，用户同意：
（1）在登记注册本平台账号时，提交个人真实、有效的身份信息；
（2）提供及时、详尽及准确的账户注册资料；
（3）不断更新注册资料，以符合及时、详尽准确的要求。
二、委托投注规则须知
1、本平台所提供服务的彩票均为经国家财政部批准发行的彩票品种，任一彩种的游戏规则以发行机构所公布的官方规则为准。
2、本平台所显示的日期与时间均为北京时间，委托投注时间以本平台服务系统的服务器时间为准。
3、作为第三方服务平台，本平台仅在用户授权的范围内，协助用户提供相应的彩票服务，并非从事互联网彩票销售工作，
3、用户明确同意委托本平台进行投注。用户成功在本平台提交投注订单并支付后并不代表彩票已经投注成功，由彩票终端系统投注出票、兑奖处理，处理周期根据不同彩票品种的操作难易性而定，订单状态中将明示订单处理情况。
4、本平台的截止时间会提前于彩票终端系统的彩票销售截止时间，以作为彩票订单处理的冗余时间，具体提前量根据不同彩票品种而定。彩票终端系统是指：彩票中心为开展彩票的销售、兑奖等业务，进行数据统计、管理，开奖、兑奖管理以及彩票资金管理等的系统。
5、为保障用户的合法权益，避免在中奖时因用户注册资料与真实情况不符而发生纠纷，请用户确保其提供的真实姓名、身份证号码及手机号码等的真实、有效及合法性。对因用户自身原因而造成的不能兑奖、不能提取现金等情况，本平台不负责任。用户提供的真实准确的个人资料将作为认定其与彩票的关联性以及用户身份的唯一证据。如果用户提供的资料包含有不真实的信息，本平台保留终止该用户继续使用服务资格的权利。
6、根据国家规定，禁止未满18周岁(未成年)者利用本平台购买彩票。同时，不提倡学生购买彩票，其中包括在校大学生。
三、委托投注服务的流程须知
1、本平台不收取任何形式的服务费。委托投注购买的彩票为电子票据，同实体票据具有相同效力。投注成功以本平台在用户可查看的订单页面显示的“出票成功”为依据。用户可查看彩票交易“订单号”状态，核对彩票出票状态。
2、本平台遵照国家相关彩票发行管理机构颁布之彩票销售规定完成彩票的委托投注服务，服务截止时间以网站公布的截止时间为准。
3、每期彩票开奖完成后，本平台将公布开奖号码情况，兑奖请参照下述相关条款执行。本平台不对开奖号码的准确性、完整性、及时性承担任何明示或默示的担保责任。
4、因包括但不限于断电、网络通讯故障、彩票终端系统原因、超过当期投注截止期、未成功付款、所投注号码被限号、投注倍数限制等原因，未能完成投注的，视为投注失败，以页面显示的出票结果为准。投注失败不会扣除用户任何费用，本平台不承担任何责任。
5、您理解并同意，因本协议产生的任何纠纷，本平台承担的责任仅限于向用户返还受影响彩票所对应的投注款项。
四、追号说明
追号服务指按用户订单，连续多期帮助用户向同一个（组）指定号码提供委托投注的服务。在此服务下，用户可以选择提前预定一个（组）号码进行多期投注，在中奖后自动取消掉后面的投注，节约购彩资金。
1、用户发出追号订单，提交自选号码、投注期次、是否基于中奖而终止追号等具体服务要求，并根据本平台提供的指引进行付款，付款金额为完成该笔追号订单所需的资金总额。
2、本平台将于用户付款后开始执行该订单，完成追号的委托投注服务。
3、用户可选择中奖后系统自动停止追号服务，即如果中奖，则追号订单中的剩余期次的投注将停止。
4、用户亦可以在订单有效期内通过“我的-全部订单—追号订单” 通道随时取消未完成的任一期追号服务或者终止所有未完成的追号服务。
5、在追号服务终止后，用户根据本条第一项支付的款项将根据追号订单的具体执行情况进行结算，系统会将未执行追号期次的购彩金额退至用户账户中。
6、用户使用追号服务的同时，不影响其使用本平台其他服务。
五、兑奖流程
（一）、系统自动兑奖：每期彩票开奖完成后，本平台公布中奖号码，并把单注壹佰万元（含，下同）以下中奖奖金直接返入中奖者账户中。您使用本平台服务即视为您同意接受系统自动兑奖。
（二）、非系统自动兑奖：以下所述是针对单注奖金超过壹佰万元的兑奖情况：
1、个人亲自兑奖： 中奖者本人亲自到彩票中心指定兑奖处进行兑奖。流程如下：
（1）本平台核实用户的账号ID、用户姓名、用户身份证号码；
（2）中奖者携带本人身份证和其他彩票中心要求的材料前往彩票中心指定的兑奖地点进行兑奖；
（3）中奖者亲自领取税后奖金。
2、个人授权兑奖：指中奖者可以选择委托彩票中心指定的主体代为兑奖。流程如下：
（1）本平台核实用户的账号ID、用户姓名、用户身份证号码；
（2）中奖者按彩票中心要求填写委托函，并连同身份证复印件一并快递给彩票中心指定的主体；
（3）彩票中心直接把中奖奖金扣税后发放到中奖者在授权委托书中指定的银行账户或本平台账户中。
3、各彩种兑奖期限不同，请中奖者注意须在兑奖期限届满前完成兑奖。
4、中奖者须妥善保管自己身份证以及彩票投注的订单信息，以防第三人冒领、代领等。
六、结算须知
1、用户可以随时进行本平台账户余额核查，登录其帐户查询对账单；
2、用户每期中奖所获得的税后奖金，本平台将按照彩票中心当期公布中奖金额范围，根据前述兑奖流程协助在10个工作日内派至用户账户。用户若核对当期中奖金额，须直接通过彩票中心公布的奖金进行核对。
3、单注彩票中奖金额高于人民币壹万元时，用户需依法缴纳个人所得税，由彩票中心依法代扣代缴，本平台不会收取任何费用。
七、不可抗力及其他免责事由
1、您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务发生中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行为等。出现上述情况时，上海玛余信息科技有限公司将努力在第一时间与相关单位配合，及时进行修复，但是由此给您造成的损失上海玛余信息科技有限公司在法律允许的范围内免责。
2、在法律允许的范围内，本平台对您基于以下情形导致的服务中断或受阻不承担责任：
(1)受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏；
(2)用户或本平台的电脑软件、系统、硬件和通信线路出现故障；
(3)用户操作不当；
(4)用户通过非本平台授权的方式使用本服务；
(5)因第三方原因造成的，包括但不限于为用户提供网络服务、支付服务等的第三主体；
(6)其他无法控制或合理预见的情形。
3、您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，本平台不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：
(1)来自他人匿名或冒名的含有威胁、诽谤、令人反感或非法内容的信息；
(2)因使用本协议项下的服务，遭受他人误导、欺骗或其他伤害；
(3)其他因网络信息或用户行为引起的风险。
4、本平台依据本协议约定获得处理违法违规内容的权利，该权利不构成我司的义务或承诺，我司不能保证及时发现违法行为或进行相应处理。
5、本平台仅根据本协议为用户提供平台技术服务。我司不是用户、彩票销售主体的代理商、合伙人、雇员或雇主等经营关系人，通过本服务发布的彩票均为彩票销售主体销售，而非本平台。因此，对发布于本平台上的彩票及相关信息的真实性、合法性、安全性，以及用户履行交易的能力等，本平台不负担保责任。用户如果因使用本服务而受有损害时，我司不负补偿或赔偿责任。在本平台上发生的任何有关彩票的咨询、投诉、纠纷等(包括但不限于投注、兑奖等事宜)均由彩票销售主体负责解决，本平台不承担责任，但我司有权尽合理的能力对双方进行协调。
6、在法律允许的范围内，本平台对您基于以下情形导致的纠纷或损失不承担责任：
(1)由于用户将账户密码告知他人或与他人共享帐户，由此导致的任何个人资料泄露，以及由此产生的纠纷及损失；
(2)任何由于黑客攻击、计算机病毒侵入或发作、网络供应商原因、因政府管制而造成的暂时性关闭等影响网络正常经营之不可抗力而造成的您个人资料或委托投注指令泄露、丢失、被盗用、被篡改等，以及由此产生的纠纷及损失；
(3)由于彩票发行中心在彩票销售过程中，临时更改玩法造成用户委托投注失败产生的纠纷及损失；
(4)本平台定期检查，或更新软硬件而造成的服务中断，或突发性的软硬件设备与电子通信设备故障产生的纠纷及损失；
(5)其他非本平台自身原因造成的未能成功投注、兑奖等产生的纠纷及损失，如国家法律法规、规章要求或彩票发行中心上级主管部门要求取消或暂停前述全部或部分服务而导致您损失的。
八、其他
1、您使用本服务即视为您已阅读并同意受本协议的约束。本平台有权在必要时修改本协议条款。您可以在本平台的最新版本中查阅相关协议条款。本协议条款变更后，如果您继续使用本服务，即视为您已接受修改后的协议。如果您不接受修改后的协议，应当停止使用本服务。
2、您知悉并同意，我司有权在单方通知您的前提下，将本协议中本平台的权利和义务一并概括转让给我司的关联公司或指定公司，具体受让的关联公司或指定的公司以我司通知为准，上述转让一经我司通知即生效。
3、本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律(不包括冲突法)。
4、若您和本平台之间因本协议发生任何纠纷或争议，首先应友好协商解决；协商不成的，您同意将纠纷或争议提交我司所在地有管辖权的人民法院管辖。
5、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
6、本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。
7、如用户对本规则有任何疑问，请登录获取相关信息或联系本平台客服，本平台将为您提供7*24小时服务。

    """.trimIndent()

    /**
     * 竞彩足球玩法
     */

    var mJczqdescribe: String? = """
1、截止时间
官方截止前 15 分钟。
官方截止时间为：
[周一至周五] 开售09:00 停售24:00
[周六至周日] 开售09:00 停售01:00

2、玩法说明：
胜平负：竞猜主队在全场90分钟（含伤停补时，不含加时赛和点球决战）的胜、平、负结果；
让球胜平负：竞猜主队在全场90分钟（含伤停补时，不含加时赛和点球决战）加减让球数后的胜、平、负结果；
什么是让球？ “-”表示主队让客队，主队的净胜球大于让球数才算主胜；“+”表示客队让主队，客队的净胜球大于让球数才算客胜。
比分：竞猜比赛双方在全场90分钟（含伤停补时，不含加时赛和点球决战）的比分；
总进球：竞猜比赛双方在全场90分钟（含伤停补时，不含加时赛和点球决战）的总进球数；
半全场：竞猜主队在上半场和全场90分钟比赛（含伤停补时，不含加时赛和点球决战）的胜、平、负结果；

3、奖金怎么算
竞彩足球过关玩法奖金以出票时的出票赔率为准；
奖金＝出票赔率连乘×2.00元×倍数；
具体计算方式举例：
选择2串1玩法，500倍;所选场次命中的出票奖金指数分别为1.77和3.77;
1)首先将所选场次的赔率连乘再乘以2，1.77*3.77*2=13.3458;
2)取小数点后三位(只舍不入)：13.345;
3)根据四舍六入五成双考虑的原则进行取舍，保留两位小数：13.34;
4)再乘以倍数得出最后奖金：13.34*500=6670元;
竞彩足球单关固定奖金以出票时刻的赔率为准；奖金=2*出票赔率*倍数；

4、延期、中断、取消的比赛，如何算奖？
1）延期比赛如何处理：
推迟时间未超过36小时，则正常算奖；
推迟时间超过36小时或无法确定时间，则该场为无效场次，按比赛取消算奖；
取消赛事算奖：单关固定玩法返还投注金额，过关投注该场赔率值按1.0计算奖金；

2）中断比赛如何处理：
36小时内继续完成比赛则正常算奖；
36小时内未完成比赛则该场为无效场次，按比赛取消算奖；
取消赛事算奖：单关固定玩法返还投注金额，过关投注该场赔率值按1.0计算奖金。

5、投注技巧
1）多场低串 提高中奖率
当你选定2场以上比赛，又不想铤而走险只做1串，可以运用两两分组的方式，做成多个2串1。比如4场比赛，形成6个2串1。
两两分组的有事在于，即使其中有的比赛猜不中，照样不影响其它小组的结果。既可以提高中奖率，同时又化繁为简。
2）设置胆拖 控制成本
投注时，将您认为一定猜中的比赛设为“胆”，则下单时只保留包含该场次的投注，从而节省投注金额。
胆拖玩法的优势在于，既可以提高中奖率，又能够减少组合数，控制成本，提高盈利率。
    """.trimIndent()

    /**
     * 竞彩篮球玩法
     */
    var mJclqdescribe = """竞彩篮球游戏推出4种游戏玩法，分别为“胜负”、“让分胜负”、“大小分”和“胜分差”，竞猜的比赛由国家体育总局体育彩票管理中心选定并向社会公布。

二、 投注方式
第一条：投注方式包括单式投注和复式投注。其中，对所选比赛场次的比赛结果均选择1种投注结果为单式投注。对于某个或某几个比赛场次选择2种或2种以上的投注结果为复式投注。
第二条：购票人选择1场比赛进行投注的为“单场投注”；选择2场或2场以上比赛进行串联投注的为“过关投注”。在过关投注中，所选比赛的结果全部竞猜正确 才能中奖。所选比赛场次的过关投注方式由国家体育总局体育彩票管理中心选定。
第三条：“竞彩篮球游戏”每注2元，不返还本金。根据投注额、突发事件等因素，销售系统可能会拒绝某些大额投注，暂停或提前截止针对某场比赛的某些特定过关组合、特定结果选项的投注，暂停或提前截止针对某场比赛的所有投注。未满18周岁的未成年人不得投注！

三、奖金计算
第一条：竞彩篮球游戏的奖金为销售额的69%，其中的68%为返奖奖金，1%为调节基金。根据游戏规则，本游戏设置浮动奖金和固定奖金。单注彩票保底奖金：如中奖者的单注奖金不足2元，将补足至2元，补足部分从调节基金中支出。
第二条：彩民的投注结果与开奖结果一致的即为中奖。每注彩票只有一次中奖机会，不兼中兼得。
第三条：浮动奖金：单场投注的奖金为浮动奖金，计算公式为：该场比赛的单场投注总投注金额÷该场比赛的单场投注中奖彩票总投注金额×68%×2元(1注)。浮动奖金的单注彩票最高限额为500万元。
第四条：固定奖金：过关投注的奖金为固定奖金。销售开始前，每个有效的过关投注组合均设置1个固定奖金；在销售过程中，该固定奖金会根据销售等情况进行实时的调整；彩民的中奖金额以完成投注时刻对应的固定奖金金额为准，不受投注完成后固定奖金调整的影响。计算公式为：[所选场次的过关赔率连乘]×2元×倍数。
第五条：固定奖金的单注彩票最高限额：
选择2-3场过关投注的，单注最高奖金限额20万元；
选择4-5场过关投注的，单注最高奖金限额50万元；
选择6场及6场以上过关投注的，单注最高奖金限额100万元。
第六条：根据法律规定，彩票的奖金收入属偶然所得，如单注彩票的中奖金额超过10000元(含10000元)人民币，中奖者需要按照相关规定缴纳中奖金额的20%的个人所得税。

四、特殊情况的处理办法
在销售过程中，如遇以下情形发生，则特别规定如下：
在某个比赛场次开始销售前，其比赛时间提前或推迟或取消比赛，则相应更改该比赛场次的开始、截止销售时间或取消该比赛场次竞猜。
在某个比赛场次开始销售后，若其比赛时间提前，则相应提前该比赛场次的截止销售时间。
在某个比赛场次开始销售后，若其比赛时间提前，且比赛开始时仍在进行销售，则认定该比赛场次对于在比赛开始时刻前发生的投注为有效场次，所涉及投注可正常参与兑奖；认定该比赛场次对于在比赛开始时刻后发生的投注则为无效场次。
在某个比赛场次开始销售后，若其比赛时间推迟且未超过原定时间36小时，则相应推迟该比赛场次的截止销售时间。
在某个比赛场次开始销售后，若其比赛时间推迟且超过原定时间36小时或无法获知具体推迟时间或取消比赛，则认定该比赛场次为无效场次。
若某个比赛场次，在比赛进行至35分钟及以上(全场时长40分钟制比赛)或进行至43分钟及以上(全场时长48分钟制比赛)时因故中断，且当值裁判或比赛主办方裁决比赛正式完成，则认定该比赛场次为有效场次，所涉及投注可正常参与兑奖。
若某个比赛场次在比赛进行中因故中断，且不符合前述(六)中描述的条件，如果自中断时刻起36小时内继续完成了比赛，则认定该比赛场次为有效场次，所涉及投注可正常参与兑奖。
若某个比赛场次在比赛进行中因故中断，且不符合前述(六)中描述的条件，如果自中断时刻起36小时内未继续完成比赛或无法获知具体补赛时间或取消补赛，则认定该比赛场次为无效场次。
在某个比赛场次开始销售后，如果比赛主办方决定更换比赛场地，若是从一中立比赛场地更换至另一中立比赛场地，则认定该比赛场次为有效场次，所涉及投注可正常参与兑奖；若不符合前述更换条件，则认定该比赛场次为无效场次。
在某个比赛场次开始销售后，若参赛双方中有一方与原定参赛队伍不同，则认定该比赛场次为无效场次。
在某个比赛场次开始销售后，若比赛主办方决定在无观众、无转播的封闭条件下进行比赛，则认定该比赛场次为无效场次。
对上述无效场次的认定由国家体育总局体育彩票管理中心最终解释。
当某场比赛被认定为无效场次，则该比赛场次的所有单场投注按退票处理，于28天内在指定地点办理退票手续；在过关投注中对该比赛场次的所有选择均视为无效，涉及该比赛场次的过关投注组合之固定奖金按在原投注时刻去除该比赛场次后的投注组合对应的固定奖金计算。
在某个比赛场次销售过程中，国家体育总局体育彩票管理中心可根据投注额、突发事件等因素，拒绝某些大额投注、暂停或提前截止针对该场比赛的某些特定过关组合特定结果选项的投注、暂停或提前截止针对该场比赛的所有投注。
无效比赛的处理：由于比赛取消、延期等原因，导致某场比赛被认定为无效场次，则该场比赛的所有单场投注按退票处理，即退还单场投注金额2元(单注)。彩民在过关投注中对该场比赛的所有选择均视为无效，固定奖金按在原投注时刻去除该场比赛后的投注组合对应的固定奖金计算，举例说明：若原方案3串1过关，其中一场被认定无效后，计算奖金时按照2串1进行计算。
竞彩篮球玩法规则
竞彩篮球游戏推出4种游戏玩法，分别为“胜负”、“让分胜负”、“大小分”和“胜分差”，竞猜的比赛由国家体育总局体育彩票管理中心选定并向社会公布。

二、 投注方式
第一条：投注方式包括单式投注和复式投注。其中，对所选比赛场次的比赛结果均选择1种投注结果为单式投注。对于某个或某几个比赛场次选择2种或2种以上的投注结果为复式投注。
第二条：购票人选择1场比赛进行投注的为“单场投注”；选择2场或2场以上比赛进行串联投注的为“过关投注”。在过关投注中，所选比赛的结果全部竞猜正确 才能中奖。所选比赛场次的过关投注方式由国家体育总局体育彩票管理中心选定。根据不同比赛场次情况，提供下表中全部或部分过关投注方式。
序号	过关方式	两关	三关	四关	五关	六关
第三条：“竞彩篮球游戏”每注2元，不返还本金。根据投注额、突发事件等因素，销售系统可能会拒绝某些大额投注，暂停或提前截止针对某场比赛的某些特定过关组合、特定结果选项的投注，暂停或提前截止针对某场比赛的所有投注。未满18周岁的未成年人不得投注！

三、奖金计算
第一条：竞彩篮球游戏的奖金为销售额的69%，其中的68%为返奖奖金，1%为调节基金。根据游戏规则，本游戏设置浮动奖金和固定奖金。单注彩票保底奖金：如中奖者的单注奖金不足2元，将补足至2元，补足部分从调节基金中支出。
第二条：彩民的投注结果与开奖结果一致的即为中奖。每注彩票只有一次中奖机会，不兼中兼得。
第三条：浮动奖金：单场投注的奖金为浮动奖金，计算公式为：该场比赛的单场投注总投注金额÷该场比赛的单场投注中奖彩票总投注金额×68%×2元(1注)。浮动奖金的单注彩票最高限额为500万元。
第四条：固定奖金：过关投注的奖金为固定奖金。销售开始前，每个有效的过关投注组合均设置1个固定奖金；在销售过程中，该固定奖金会根据销售等情况进行实时的调整；彩民的中奖金额以完成投注时刻对应的固定奖金金额为准，不受投注完成后固定奖金调整的影响。计算公式为：[所选场次的过关赔率连乘]×2元×倍数。
第五条：固定奖金的单注彩票最高限额：
选择2-3场过关投注的，单注最高奖金限额20万元；
选择4-5场过关投注的，单注最高奖金限额50万元；
选择6场及6场以上过关投注的，单注最高奖金限额100万元。
第六条：根据法律规定，彩票的奖金收入属偶然所得，如单注彩票的中奖金额超过10000元(含10000元)人民币，中奖者需要按照相关规定缴纳中奖金额的20%的个人所得税。

四、特殊情况的处理办法
在销售过程中，如遇以下情形发生，则特别规定如下：
在某个比赛场次开始销售前，其比赛时间提前或推迟或取消比赛，则相应更改该比赛场次的开始、截止销售时间或取消该比赛场次竞猜。在某个比赛场次开始销售后，若其比赛时间提前，则相应提前该比赛场次的截止销售时间。
在某个比赛场次开始销售后，若其比赛时间提前，且比赛开始时仍在进行销售，则认定该比赛场次对于在比赛开始时刻前发生的投注为有效场次，所涉及投注可正常参与兑奖；认定该比赛场次对于在比赛开始时刻后发生的投注则为无效场次。
在某个比赛场次开始销售后，若其比赛时间推迟且未超过原定时间36小时，则相应推迟该比赛场次的截止销售时间。
在某个比赛场次开始销售后，若其比赛时间推迟且超过原定时间36小时或无法获知具体推迟时间或取消比赛，则认定该比赛场次为无效场次。
若某个比赛场次，在比赛进行至35分钟及以上(全场时长40分钟制比赛)或进行至43分钟及以上(全场时长48分钟制比赛)时因故中断，且当值裁判或比赛主办方裁决比赛正式完成，则认定该比赛场次为有效场次，所涉及投注可正常参与兑奖。
若某个比赛场次在比赛进行中因故中断，且不符合前述(六)中描述的条件，如果自中断时刻起36小时内继续完成了比赛，则认定该比赛场次为有效场次，所涉及投注可正常参与兑奖。
若某个比赛场次在比赛进行中因故中断，且不符合前述(六)中描述的条件，如果自中断时刻起36小时内未继续完成比赛或无法获知具体补赛时间或取消补赛，则认定该比赛场次为无效场次。
在某个比赛场次开始销售后，如果比赛主办方决定更换比赛场地，若是从一中立比赛场地更换至另一中立比赛场地，则认定该比赛场次为有效场次，所涉及投注可正常参与兑奖；若不符合前述更换条件，则认定该比赛场次为无效场次。
在某个比赛场次开始销售后，若参赛双方中有一方与原定参赛队伍不同，则认定该比赛场次为无效场次。
在某个比赛场次开始销售后，若比赛主办方决定在无观众、无转播的封闭条件下进行比赛，则认定该比赛场次为无效场次。对上述无效场次的认定由国家体育总局体育彩票管理中心最终解释。
当某场比赛被认定为无效场次，则该比赛场次的所有单场投注按退票处理，于28天内在指定地点办理退票手续；在过关投注中对该比赛场次的所有选择均视为无效，涉及该比赛场次的过关投注组合之固定奖金按在原投注时刻去除该比赛场次后的投注组合对应的固定奖金计算。
在某个比赛场次销售过程中，国家体育总局体育彩票管理中心可根据投注额、突发事件等因素，拒绝某些大额投注、暂停或提前截止针对该场比赛的某些特定过关组合特定结果选项的投注、暂停或提前截止针对该场比赛的所有投注。
无效比赛的处理：由于比赛取消、延期等原因，导致某场比赛被认定为无效场次，则该场比赛的所有单场投注按退票处理，即退还单场投注金额2元(单注)。彩民在过关投注中对该场比赛的所有选择均视为无效，固定奖金按在原投注时刻去除该场比赛后的投注组合对应的固定奖金计算，举例说明：若原方案3串1过关，其中一场被认定无效后，计算奖金时按照2串1进行计算。
    """
}